{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "name": "03_10.ipynb",
      "provenance": [],
      "collapsed_sections": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "1w1SXvIot-mn"
      },
      "source": [
        "Разминка"
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "9eSAstXAuBeh"
      },
      "source": [
        "Считывается строка следующего формата:\n",
        "\"*Name*Age\"\n",
        "Например\n",
        "'*Ivan*22'\n",
        "Задача - написать программу, которая будет здороваться с посетителем и выводить следующую строку \"Здравствуй, Ivan\". \n",
        "При этом если ему больше 18 - будет здороваться уважительно \n",
        "'Здравствуйте, Ivan'"
      ],
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "Rs46v1YarM5e"
      },
      "source": [
        "Задачка 1"
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "zGfEboX5rPXD"
      },
      "source": [
        "Данные о оценке услуг клиентов косметической компании представлены в списке. Каждый элемент маленького списка - \n",
        "это оценка какой-то очередной услуги, типа ноготочки, покраска волос и т.п. \n",
        "Количество услуг, оказанных клиентом может разниться. Сотрудника салона увольняют, \n",
        "если хотя бы один из клиентов В СРЕДНЕМ поставил x2 = 1.7 или меньше. \n",
        "Напишите функцию, которая принимает на вход список lst и пороговые значения x1 и x2 и возвращает логическую константу True, \n",
        "если сотрудника нужно уволить и False, если не нужно"
      ],
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "iYn8GTFPsPyi"
      },
      "source": [
        "a = [[1,3,5], [5,5], [1,4,5,5,5], [3]]"
      ],
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "ao52C_RBsozO"
      },
      "source": [
        "Небольшое усложнение задачки 1\n"
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "OuPhfKRoszvf"
      },
      "source": [
        "Данные о оценке услуг клиентов косметической компании представлены в списке. Каждый элемент маленького списка - \n",
        "это оценка какой-то очередной услуги, типа ноготочки, покраска волос и т.п. \n",
        "Количество услуг, оказанных клиентом может разниться. Сотрудника салона увольняют, \n",
        "если средняя оценка ХОТЯ БЫ ДВУХ клиентов не превосходит x1 = 2.5 или \n",
        "если хотя бы один из клиентов В СРЕДНЕМ поставил x2 = 1.7 или меньше. \n",
        "Напишите функцию, которая принимает на вход список lst и пороговые значения x1 и x2 и возвращает логическую константу True, \n",
        "если сотрудника нужно уволить и False, если не нужно"
      ],
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "fI9oHdNks4uC"
      },
      "source": [
        "Задачка 2"
      ],
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "BvDevP08q2aG"
      },
      "source": [
        "На входе имеем список строк разной длины. \n",
        "Необходимо написать функцию all_eq(lst), которая вернет новый список из строк одинаковой длины. \n",
        "Длину итоговой строки определяем исходя из самой большой из них. \n",
        "Если конкретная строка короче самой длинной, дополнить ее нижними подчеркиваниями с правого края до требуемого количества символов.\n",
        "Расположение элементов начального списка не менять."
      ],
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "fMTUxCQJrBak"
      },
      "source": [
        "Идея решения:\n",
        "Сначала необходимо определить длину каждой строки в списке и найти максимальную. Далее дополняем символы «_» к строкам, чья длина меньше."
      ],
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "e8X7XQn3rMVK"
      },
      "source": [
        "Задачка 3"
      ],
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "kVsz_HactH8p"
      },
      "source": [
        "Про Н\n",
        "Есть в файл, в котором ПОСТРОЧНО записаны фамилии кандидатов, за которых проголосовали в рамках выборов президента страны\n",
        "Определить, кто победил и какой процент голосов он набрал от общего числа\n"
      ],
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "5_w8gPAgtdNi"
      },
      "source": [
        "# считываем строки из файла в список, способ 1\n",
        "\n",
        "lines = [] # создаем пустой список\n",
        "with open('Vybory.txt', encoding='UTF-8') as infile:\n",
        "    for line in infile: # проходимся по файлу построчно\n",
        "        lines.append(line.strip()) # добавляем строку + удаляем знак перехода на новую строку\n",
        "print(lines)"
      ],
      "execution_count": null,
      "outputs": []
    }
  ]
}